In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
!ls ./

Concatenate和Combine.ipynb
DataFrame的merge操作.ipynb
Series和DataFrame的排序.ipynb
Series和DataFrame的简单数学运算.ipynb
apply_demo.csv
imdb_result.csv
movie_metadata.csv
通过apply进行数据预处理.ipynb
重命名Dataframe的Index.ipynb

In [3]:
df = pd.read_csv('./apply_demo.csv')

In [4]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [5]:
df.size

7978

In [6]:
s1 = Series(['a']*7978)

In [7]:
s1

0       a
1       a
2       a
3       a
4       a
5       a
6       a
7       a
8       a
9       a
10      a
11      a
12      a
13      a
14      a
15      a
16      a
17      a
18      a
19      a
20      a
21      a
22      a
23      a
24      a
25      a
26      a
27      a
28      a
29      a
       ..
7948    a
7949    a
7950    a
7951    a
7952    a
7953    a
7954    a
7955    a
7956    a
7957    a
7958    a
7959    a
7960    a
7961    a
7962    a
7963    a
7964    a
7965    a
7966    a
7967    a
7968    a
7969    a
7970    a
7971    a
7972    a
7973    a
7974    a
7975    a
7976    a
7977    a
Length: 7978, dtype: object

In [8]:
df['A'] = s1

In [9]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  a

In [10]:
df['A'] = df['A'].apply(str.upper)

In [11]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [12]:
l1 = df['data'][0].strip().split(' ')

In [13]:
l1[1], l1[3],l1[5]

('APPL', '0', '1623')

In [14]:
def foo(line):
    items = line.strip().split(' ')
    return Series([items[1], items[3], items[5]])

In [15]:
df_tmp = df['data'].apply(foo)

In [16]:
df_tmp = df_tmp.rename(columns={0:"Symbol", 1:"Seqno", 2:"Price"})

In [18]:
df_tmp.head()

  Symbol Seqno Price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [19]:
df_new = df.combine_first(df_tmp)

In [20]:
del df_new['data']

In [21]:
del df_new['A']
df_new.head()

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963

In [23]:
df_new.to_csv('./demo_duplicate.csv')

In [24]:
!ls ./

Concatenate和Combine.ipynb
DataFrame的merge操作.ipynb
Series和DataFrame的排序.ipynb
Series和DataFrame的简单数学运算.ipynb
apply_demo.csv
demo_duplicate.csv
imdb_result.csv
movie_metadata.csv
通过apply进行数据预处理.ipynb
重命名Dataframe的Index.ipynb